import pandas as pd

print('----' * 30)
print('Табель учащихся в средней образовательной школе # 1229')

stud_card = {
    'ID': ['01', '02', '03', '04', '05'],
    'Имя': ['Екатерина', 'Мария', 'Раиса', 'Надежда', 'Наталья'],
    'Фамилия': ['Узбекова', 'Терехова', 'Гонтаренко', 'Бабенкова', 'Евдокимова'],
    'Дата рождения': ['17.08.2010', '04.05.2011', '01.04.2009', '23.02.2012', '08.03.2014'],
    'Успеваемость': ['Хорошист', 'Троечник', 'Хорошист', 'Отличник', 'Троечник']
}

sc = pd.DataFrame(data=stud_card)

with open('schoolchildren.csv', 'a', encoding='UTF-8') as cl:
    cl.write(f'{sc}')
    cl.write('\n')

print(sc)